const provinces = [
  {
    name: "آذربایجان شرقی",
    cities: ["تبریز", "مرند", "میانه", "شبستر", "اسکو", "هریس", "اهر", "بستان‌آباد", "هشترود", "سراب", "کلیبر", "جلفا", "بناب", "ملکان", "آذرشهر", "شرفخانه", "صوفیان", "ایلخچی", "خسروشهر", "زنوز", "ممقان", "سیس", "سهند", "تیکمه‌داش", "ترک", "ترکمانچای", "وایقان", "خامنه", "شندآباد", "سردرود", "گوگان", "لیلان", "مهرگان"]
  },
  {
    name: "آذربایجان غربی",
    cities: ["ارومیه", "خوی", "مهاباد", "بوکان", "سلماس", "ماکو", "سردشت", "پیرانشهر", "نقده", "تکاب", "شاهین‌دژ", "اشنویه", "چالدران", "پلدشت", "سیه‌چشمه", "قره‌ضیاءالدین", "ربط", "محمدیار", "گردکشانه", "نالوس", "میرآباد", "تازه‌شهر", "سرو", "دیزج", "زرآباد", "فیرورق", "قوشچی", "سیلوانه", "خلیفان", "مرگنلر"]
  },
  {
    name: "اردبیل",
    cities: ["اردبیل", "مشگین‌شهر", "نمین", "نیر", "سرعین", "بیله‌سوار", "پارس‌آباد", "خلخال", "گرمی", "کوراییم", "هیر", "لاهرود", "رضی", "عنبران", "آبی‌بیگلو", "گیوی", "تازه‌کند", "قصابه", "مرادلو", "اصلاندوز", "کلور", "انگوت"]
  },
  {
    name: "اصفهان",
    cities: ["اصفهان", "کاشان", "خمینی‌شهر", "نجف‌آباد", "شاهین‌شهر", "باغ‌بهادران", "خوراسگان", "گلپایگان", "خوانسار", "دهاقان", "سمیرم", "درچه", "زاینده‌رو", "تیران", "فریدن", "فریدون‌شهر", "چادگان", "نطنز", "اردستان", "میمه", "شاهین‌شهر", "برخوار", "جرقویه", "زرین‌شهر", "آران و بیدگل", "ورزنه", "کوهپایه", "ابریشم", "حبیب‌آباد", "نایین", "خورزوق", "دولت‌آباد", "کمشچه", "سگزی", "هرند", "پیربکران", "فلاورجان", "قهدریجان", "جوزدان", "دهق", "علویجه", "حسن‌آباد", "کلیشاد و سودرجان", "محمدآباد", "مجلسی", "وزوان", "جوشقان قالی"]
  },
  {
    name: "البرز",
    cities: ["کرج", "هشتگرد", "نظرآباد", "طالقان", "اشتهارد", "فردیس", "ماهدشت", "کمال‌شهر", "گرمدره", "محمدشهر", "تنکمان", "نصیرشهر", "کوهسار", "آسارا", "شهرک گلستان", "مشکین‌دشت", "چهارباغ", "پیشوا"]
  },
  {
    name: "ایلام",
    cities: ["ایلام", "دهلران", "مهران", "آبدانان", "ایوان", "دره‌شهر", "آسمان‌آباد", "سرابله", "چوار", "بدره", "صالح‌آباد", "موسیان", "مهر", "ارکواز", "لومار", "توحید", "زرنه", "میمه", "کلان"]
  },
  {
    name: "بوشهر",
    cities: ["بوشهر", "کنگان", "گناوه", "دیر", "جم", "دشتی", "تنگستان", "دیلم", "خورموج", "اهرم", "برازجان", "خارک", "عسلویه", "سیراف", "ریز", "آباد", "بنک", "شنبه", "کاکی", "وحدتیه", "چغادک", "بندرریگ", "بندردیلم", "امام‌حسن"]
  },
  {
    name: "تهران",
    cities: ["تهران", "اسلام‌شهر", "ری", "شهریار", "پردیس", "دماوند", "ورامین", "پاکدشت", "قدس", "ملارد", "رباط‌کریم", "شهریار", "قرچک", "پیشوا", "فیروزکوه", "لواسان", "کهریزک", "بومهن", "صالحیه", "جوادآباد", "نسیم‌شهر", "چهاردانگه", "گلستان", "اندیشه", "آبسرد", "آبعلی", "شریف‌آباد", "فرون‌آباد", "وحیدیه", "صفادشت", "ارجمند", "فشم", "آدران", "کیلان", "نصیرشهر"]
  },
  {
    name: "چهارمحال و بختیاری",
    cities: ["شهرکرد", "فارسان", "بروجن", "لردگان", "اردل", "بن", "سامان", "نافچ", "جونقان", "طاقانک", "گندمان", "بلداجی", "نقنه", "هفشجان", "فرخ‌شهر", "کیان", "سودجان", "صمصامی", "بازفت", "چلگرد", "دستنا", "شلمزار", "سورشجان", "گهرو", "وردنجان", "دشتک", "سرخون", "پردنجان", "منج", "آلونی", "چلیچه", "سردشت", "شیخ‌شعیب"]
  },
  {
    name: "خراسان جنوبی",
    cities: ["بیرجند", "قاین", "نهبندان", "درمیان", "سربیشه", "فردوس", "طبس", "سرایان", "خوسف", "زیرکوه", "اسدیه", "آیسک", "قهستان", "گزیک", "حاجی‌آباد", "شوسف", "اسفدن", "مود", "دیهوک", "نیمبلوک", "ارسک", "آرین‌شهر", "اسلامیه", "گزند", "خضری", "چاهداشی", "قهستان", "میغان", "سه‌قلعه"]
  },
  {
    name: "خراسان رضوی",
    cities: ["مشهد", "نیشابور", "سبزوار", "تربت‌حیدریه", "خواف", "تربت‌جام", "کاشمر", "گناباد", "فریمان", "چناران", "سرخس", "بردسکن", "تایباد", "قوچان", "رشتخوار", "باخرز", "فیروزه", "بجستان", "درگز", "مه‌ولات", "داورزن", "جغتای", "نقاب", "سلامی", "کلات", "ششتمد", "جنگل", "ریوش", "قلندرآباد", "شادمهر", "انابد", "نیل‌شهر", "بایگ", "کاریز", "یونسی", "سنگان", "دولت‌آباد", "احمدآباد", "روداب", "شهرآباد", "کدکن", "نشتیفان", "سلطان‌آباد", "باجگیران", "قدمگاه", "فیض‌آباد", "خرو", "داورزن"]
  },
  {
    name: "خراسان شمالی",
    cities: ["بجنورد", "شیروان", "اسفراین", "جاجرم", "فاروج", "مانه و سملقان", "راز و جرگلان", "پیشقلعه", "حصارگرمخان", "لوجلی", "تیتکانلو", "سنخواست", "شوقان", "آشخانه", "قاضی", "درق", "ایور", "گلیان", "زیارت", "چناران", "درازآب", "صفی‌آباد"]
  },
  {
    name: "خوزستان",
    cities: ["اهواز", "دزفول", "اندیمشک", "آبادان", "خرمشهر", "بهبهان", "شوش", "شوشتر", "مسجدسلیمان", "ایذه", "رامهرمز", "باغ‌ملک", "هفتکل", "رامشیر", "امیدیه", "لالی", "هویزه", "حمیدیه", "کارون", "بندر ماهشهر", "شادگان", "چمران", "اندیکا", "گتوند", "آغاجاری", "بستان", "هندیجان", "قلعه‌تل", "صیدون", "رفیع", "مینوشهر", "چویبده", "سرداران", "ویس", "جایزان", "قلعه‌خواجه", "ترکالکی", "میداود", "شرافت", "سوسنگرد", "الوان", "چغامیش", "حسینیه", "زهره", "اروندکنار", "دارخوین", "مشراگه", "جنت‌مکان"]
  },
  {
    name: "زنجان",
    cities: ["زنجان", "ابهر", "خرمدره", "قیدار", "خدابنده", "ایجرود", "طارم", "ماهنشان", "سلطانیه", "سجاس", "آب‌بر", "چورزق", "حلب", "زرین‌آباد", "زرین‌رود", "سهرورد", "نیک‌پی", "گرماب", "هیدج", "زنجانرود", "دندی", "بزینه‌رود", "آقکند", "قره‌پشتلو", "مهماندوست", "پری", "کرسف", "نوربهار", "فاراب", "چایپاره", "سیردان", "گاوازنگ", "میلاجرد"]
  },
  {
    name: "سمنان",
    cities: ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدی‌شهر", "سرخه", "آرادان", "میامی", "کلاته", "بسطام", "بیارجمند", "رودیان", "دیباج", "ایوانکی", "امیریه", "شهمیرزاد", "مجن", "کلاته‌خیج", "درجزین", "فرومد", "تویه‌دروار", "معدن", "چشمه‌علی", "قلعه‌نو", "خیرآباد", "رقه", "خطیرکوه"]
  },
  {
    name: "سیستان و بلوچستان",
    cities: ["زاهدان", "زابل", "چابهار", "سراوان", "خاش", "ایرانشهر", "نیک‌شهر", "میرجاوه", "سرباز", "راسک", "دلگان", "زهک", "هیرمند", "کنارک", "فنوج", "قصرقند", "گلمورتی", "بمپور", "محمدان", "نصرت‌آباد", "اسپکه", "سوران", "جالق", "پیشین", "زرآباد", "محمدی", "تفتان", "بزمان", "ادیمی", "هیدوچ", "کوهک", "دوست‌محمد", "علی‌اکبر", "سیرکان", "بنجار", "محمدآباد", "گشت", "کتیج", "اسفندک", "شهرک علی‌اکبر", "لاشار", "آشار", "دشتیاری"]
  },
  {
    name: "فارس",
    cities: ["شیراز", "مرودشت", "جهرم", "کازرون", "داراب", "فسا", "لار", "لامرد", "اقلید", "نی ریز", "استهبان", "کوار", "ممسنی", "فراشبند", "سپیدان", "بوانات", "خرامه", "خنج", "گراش", "رستم", "حاجی‌آباد", "زرقان", "خفر", "کارزین", "مهر", "اردکان", "بیضا", "قیر و کارزین", "سروستان", "اشکنان", "اوز", "بیرم", "جویم", "خور", "دبیران", "دژکرد", "دهرم", "رونیز", "زاهدشهر", "سعادت‌شهر", "شهرصدرا", "شیراز", "صغاد", "علامرودشت", "فدامی", "قادرآباد", "قطب‌آباد", "کوهنجان", "مادرسلیمان", "مزایجان", "نوبندگان", "نودان", "ویس", "هماشهر", "ایزدخواست", "بابانار", "بهمن", "حسن‌آباد", "دوبرجی", "رامجرد", "سورمق", "سیاخ", "ششده", "کامفیروز", "کنارتخته", "گله‌دار", "میمند", "نورآباد"]
  },
  {
    name: "قزوین",
    cities: ["قزوین", "آبیک", "بوئین‌زهرا", "تاکستان", "الوند", "محمدیه", "ارداق", "اسفرورین", "آوج", "شال", "خرمدشت", "سگزآباد", "سیردان", "ضیاءآباد", "کوهین", "محمودآباد", "معلم‌کلایه", "نرجه", "خاکعلی", "آبگرم", "رازمیان", "سعیدآباد", "شریفیه", "قاقازان", "گرمارود", "مبارک‌آباد", "نوده", "هیر", "پنبه‌چین", "اقبالیه", "بیدستان", "سعدالسلطنه", "شهرک صنعتی", "کوهین", "نیارک"]
  },
  {
    name: "قم",
    cities: ["قم", "جعفریه", "دستجرد", "سلفچگان", "قنوات", "کهک", "نوفل‌لوشاتو", "سعدآباد"]
  },
  {
    name: "کردستان",
    cities: ["سنندج", "بیجار", "قروه", "دیواندره", "سقز", "بانه", "مریوان", "کامیاران", "دهگلان", "چناره", "زرینه", "دلبران", "سریش‌آباد", "موچش", "یاسوکند", "بلبان‌آباد", "شویشه", "کانی‌سور", "بویین‌سفلی", "کانی‌دینار", "برده‌رشه", "توپ‌آغاج", "بابارشانی", "پیرتاج", "آرمرده", "بابارشانی", "شوی", "کانی‌شین", "زرآباد", "خاو و میرآباد", "سیوان", "کانی‌پران", "یونسی", "اورامان", "پالنگان", "ننور", "بلبر", "نودشه", "ژاورود", "کانی‌رز", "شاهو", "کانی‌مالان"]
  },
  {
    name: "کرمان",
    cities: ["کرمان", "رفسنجان", "زرند", "بم", "سیرجان", "راور", "بافت", "جیرفت", "بردسیر", "کهنوج", "منوجان", "قلعه‌گنج", "رودبار", "عنبرآباد", "کوهبنان", "انار", "راین", "هنزا", "خانوک", "نرماشیر", "فهرج", "دشتکار", "مس سرچشمه", "گلباف", "اختیارآباد", "اندوهجرد", "باغین", "پاریز", "تخت", "جوپار", "چترود", "خاتون‌آباد", "درب بهشت", "دهج", "رابر", "زنگی‌آباد", "زهکلوت", "شهداد", "صفائیه", "لاله‌زار", "ماهان", "محی‌آباد", "مردهک", "نظام‌شهر", "نگار", "هجدک", "پاریز", "خورسند", "دوساری", "جبالبارز", "اسفندقه", "بلورد", "بلوک", "بهرمان", "جوزم", "دوساری", "رحمت‌آباد", "زیدآباد", "ساردوئیه", "شهربابک", "گزوئیه", "گور", "محمدآباد", "میمند", "نودژ", "هروز", "یزدان‌شهر"]
  },
  {
    name: "کرمانشاه",
    cities: ["کرمانشاه", "سنقر", "صحنه", "قصرشیرین", "پاوه", "جوانرود", "کنگاور", "هرسین", "روانسر", "گیلانغرب", "سرپل‌ذهاب", "ثلاث‌باباجانی", "دالاهو", "کرند", "باینگان", "ازگله", "تازه‌آباد", "سطر", "شاهو", "نودشه", "نوسود", "هلشی", "میان‌راهان", "حر", "رباط", "سرمست", "سومار", "سومار", "قزوینه", "کوزران", "گهواره", "ماهیدشت", "میان‌راهان", "چقابل", "اسلام‌آباد", "بزلانه", "تکاب", "جوانرود", "حمیل", "ریجاب", "زواریج", "سومار", "شاهو", "گواور", "میرآباد", "نودشه", "هرسین"]
  },
  {
    name: "کهگیلویه و بویراحمد",
    cities: ["یاسوج", "دوگنبدان", "لیکک", "سی‌سخت", "چرام", "پاتاوه", "دهدشت", "سوق", "مارگون", "باشت", "گراب", "لنده", "چیتاب", "سرفاریاب", "کاکان", "مادوان", "سپیدار", "دیشموک", "سردشت", "قلعه‌رییسی"]
  },
  {
    name: "گلستان",
    cities: ["گرگان", "گنبد کاووس", "علی‌آباد", "آق‌قلا", "بندر ترکمن", "رامیان", "کردکوی", "مینودشت", "کلاله", "مراوه‌تپه", "نوکنده", "سیمین‌شهر", "انبارآلوم", "نوده خاندوز", "فراغی", "جلین", "دلند", "سرخنکلاته", "نگین‌شهر", "سنگدوین"]
  },
  {
    name: "گیلان",
    cities: ["رشت", "انزلی", "لاهیجان", "تالش", "آستارا", "رودسر", "صومعه‌سرا", "فومن", "ماسال", "رودبار", "آستانه اشرفیه", "بندرانزلی", "کلاچای", "هشتپر", "رضوانشهر", "ماسوله", "چابکسر", "لنگرود", "شفت", "سیاهکل", "املش", "خشکبیجار", "لشت نشا", "سنگر", "کوچصفهان", "بازار جمعه"]
  },
  {
    name: "لرستان",
    cities: ["خرم‌آباد", "دورود", "الشتر", "بروجرد", "الیگودرز", "نورآباد", "کوهدشت", "پلدختر", "ازنا", "سپیددشت", "چالانچولان", "زاغه", "سراب‌دوره", "فیروزآباد", "مومن‌آباد", "کونانی", "هفت‌چشمه", "اشترینان", "معمولان", "کوهنانی", "چقابل", "ویسیان", "بیران‌شهر"]
  },
  {
    name: "مازندران",
    cities: ["ساری", "بابل", "آمل", "قائم‌شهر", "نکا", "بهشهر", "رامسر", "نور", "تنکابن", "جویبار", "چالوس", "محمودآباد", "فریدونکنار", "کلاردشت", "عباس‌آباد", "سیمرغ", "گلوگاه", "زیرآب", "پل سفید", "رستمکلا", "میاندورود", "کتالم", "سلمان‌شهر", "مرزن‌آباد"]
  },
  {
    name: "مرکزی",
    cities: ["اراک", "خمین", "محلات", "ساوه", "تفرش", "شازند", "دلیجان", "زرندیه", "کمیجان", "آشتیان", "نراق", "مهاجران", "فرمهین", "نیمور", "هندودر", "خنداب", "غرق‌آباد", "مامونیه", "آستانه", "کارچان", "پرندک", "داودآباد"]
  },
  {
    name: "هرمزگان",
    cities: ["بندرعباس", "قشم", "بندر لنگه", "میناب", "جاسک", "کیش", "بندر خمیر", "رودان", "حاجی‌آباد", "سیریک", "ابوموسی", "پارسیان", "بشاگرد", "تخت", "درگهان", "سوزا", "فین", "کنگ", "هشتبندی", "چارک", "زیارت", "لمزان", "تیرور"]
  },
  {
    name: "همدان",
    cities: ["همدان", "نهاوند", "ملایر", "تویسرکان", "کبودرآهنگ", "رزن", "اسدآباد", "بهار", "لالجین", "مریانج", "فامنین", "قهاوند", "شراء", "جورقان", "گل تپه", "سرکان", "دمق", "فرسفج", "سامن", "زنگنه", "آجین", "برزول"]
  },
  {
    name: "یزد",
    cities: ["یزد", "میبد", "اردکان", "بافق", "مهریز", "تفت", "اشکذر", "بهاباد", "حمیدیا", "زارچ", "شاهدیه", "ندوشن", "خضرآباد", "عقدا", "مروست", "احمدآباد", "بفروئیه", "تنگ چنار", "زارچ", "شهیدیه", "علی‌آباد", "نیر"]
  }
];

export default provinces;
